epm 테이블로 연습

In [485]:
import numpy as np
import pandas as pd

In [13]:
emp = pd.read_csv('../file/emp.csv', parse_dates=['HIREDATE'])
emp.head()

   EMPNO   ENAME       JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30

In [20]:
# 컬럼명 소문자로
emp.columns = emp.columns.str.lower()
emp.head()

   empno   ename       job     mgr   hiredate   sal    comm  deptno
0   7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
1   7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2   7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
3   7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
4   7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30

```
select * from emp;
```

In [11]:
emp
# 데이터를 다 데려오는건 위험하긴한데 연습용이니 괜찮 ㅎㅎ

    EMPNO   ENAME        JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

```
select ename from emp;
```

In [24]:
emp['ename']

0      SMITH
1      ALLEN
2       WARD
3      JONES
4     MARTIN
5      BLAKE
6        CCC
7      SCOTT
8       KING
9     TURNER
10     ADAMS
11     JAMES
12      FORD
13    MILLER
Name: ename, dtype: object

In [23]:
emp[['ename']]

     ename
0    SMITH
1    ALLEN
2     WARD
3    JONES
4   MARTIN
5    BLAKE
6      CCC
7    SCOTT
8     KING
9   TURNER
10   ADAMS
11   JAMES
12    FORD
13  MILLER

In [35]:
print(type(emp['ename'])) # Series
print(type(emp[['ename']])) # DataFrame
print(len(emp['ename']))
print(len(emp[['ename']]))
print(emp['ename'].shape)
print(emp[['ename']].shape)

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
14
14
(14,)
(14, 1)

```
select empno, ename from emp;
```

In [21]:
emp[['empno', 'ename']]

    empno   ename
0    7369   SMITH
1    7499   ALLEN
2    7521    WARD
3    7566   JONES
4    7654  MARTIN
5    7698   BLAKE
6    7782     CCC
7    7788   SCOTT
8    7839    KING
9    7844  TURNER
10   7876   ADAMS
11   7900   JAMES
12   7902    FORD
13   7934  MILLER

# 컬럼접근 select

## iloc
```
iloc[줄, 칸] # 인덱스로 접근
```

In [63]:
emp.iloc[ 0 ]

empno                      7369
ename                     SMITH
job                       CLERK
mgr                      7902.0
hiredate    1980-12-17 00:00:00
sal                         800
comm                        NaN
deptno                       20
Name: 0, dtype: object

In [64]:
emp.iloc[ [0,3,5,7] ]

   empno  ename      job     mgr   hiredate   sal  comm  deptno
0   7369  SMITH    CLERK  7902.0 1980-12-17   800   NaN      20
3   7566  JONES  MANAGER  7839.0 1981-04-02  2975   NaN      20
5   7698  BLAKE  MANAGER  7839.0 1981-05-01  2850   NaN      30
7   7788  SCOTT  ANALYST  7566.0 1987-07-13  3000   NaN      20

In [66]:
emp.iloc[ 0:4 ]

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30
3   7566  JONES   MANAGER  7839.0 1981-04-02  2975    NaN      20

In [67]:
emp.iloc[ 0, 0 ]

7369

In [83]:
emp.iloc[ [1,3,5,7], [1,2,-1] ]

   ename       job  deptno
1  ALLEN  SALESMAN      30
3  JONES   MANAGER      20
5  BLAKE   MANAGER      30
7  SCOTT   ANALYST      20

In [104]:
emp.iloc[ 3:10, 1:7 ]

    ename        job     mgr   hiredate   sal    comm
3   JONES    MANAGER  7839.0 1981-04-02  2975     NaN
4  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0
5   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN
6     CCC    MANAGER  7839.0 1981-06-09  2450     NaN
7   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN
8    KING  PRESIDENT     NaN 1981-11-17  5000     NaN
9  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0

In [106]:
emp.iloc[[0,3,5],:]

   empno  ename      job     mgr   hiredate   sal  comm  deptno
0   7369  SMITH    CLERK  7902.0 1980-12-17   800   NaN      20
3   7566  JONES  MANAGER  7839.0 1981-04-02  2975   NaN      20
5   7698  BLAKE  MANAGER  7839.0 1981-05-01  2850   NaN      30

## loc
```
loc[인덱스값, 컬럼값] # 값으로 접근
```

In [107]:
emp.loc[ 0:2, 'empno' ]

0    7369
1    7499
2    7521
Name: empno, dtype: int64

In [109]:
t = ['empno', 'ename']

emp.loc[ 0:2, t ]

   empno  ename
0   7369  SMITH
1   7499  ALLEN
2   7521   WARD

In [111]:
emp.loc[ 0:3, 'empno':'mgr' ]

   empno  ename       job     mgr
0   7369  SMITH     CLERK  7902.0
1   7499  ALLEN  SALESMAN  7698.0
2   7521   WARD  SALESMAN  7698.0
3   7566  JONES   MANAGER  7839.0

<font color='red'>loc의 슬라이싱(:)은 이상:이하로 취급</fort>

잘 가져와보자
```
SALESMAN	7698	1981-02-20 00:00:00
SALESMAN	7698	1981-02-22 00:00:00
MANAGER		7839	1981-04-02 00:00:00
SALESMAN	7698	1981-09-28 00:00:00
```

In [124]:
emp.iloc[1:5,2:5]

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

In [125]:
emp.loc[1:4,'job':'hiredate']

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

## as
```
select sal, sal*12 as asal from emp;
```

In [257]:
asal = ( emp[['sal']]*12 ).rename( columns={'sal':'asal'} )

pd.concat([ emp[['sal']],asal ], axis=1 )

     sal   asal
0    800   9600
1   1600  19200
2   1250  15000
3   2975  35700
4   1250  15000
5   2850  34200
6   2450  29400
7   3000  36000
8   5000  60000
9   1500  18000
10  1100  13200
11   950  11400
12  3000  36000
13  1300  15600

In [267]:
empcp = emp.copy()
empcp['asal'] = empcp['sal']*12
empcp[['sal','asal']]

     sal   asal
0    800   9600
1   1600  19200
2   1250  15000
3   2975  35700
4   1250  15000
5   2850  34200
6   2450  29400
7   3000  36000
8   5000  60000
9   1500  18000
10  1100  13200
11   950  11400
12  3000  36000
13  1300  15600

## 문자열 합치기

```
select job||ename from emp;
select concat(job, ename) from emp;
```

In [215]:
emp['job'] + emp['ename']

0         CLERKSMITH
1      SALESMANALLEN
2       SALESMANWARD
3       MANAGERJONES
4     SALESMANMARTIN
5       MANAGERBLAKE
6         MANAGERCCC
7       ANALYSTSCOTT
8      PRESIDENTKING
9     SALESMANTURNER
10        CLERKADAMS
11        CLERKJAMES
12       ANALYSTFORD
13       CLERKMILLER
dtype: object

# 조건 where
```
df[ 조건 ][ 컬럼 ]

df[ 조건 ][ [컬럼1,컬럼2] ]

df[ 컬럼 ][ 조건 ]

df[ [컬럼1,컬럼2] ][ 조건 ]
```

```
select empno, empno from emp;
```

In [148]:
emp[ ['empno','ename'] ]

    empno   ename
0    7369   SMITH
1    7499   ALLEN
2    7521    WARD
3    7566   JONES
4    7654  MARTIN
5    7698   BLAKE
6    7782     CCC
7    7788   SCOTT
8    7839    KING
9    7844  TURNER
10   7876   ADAMS
11   7900   JAMES
12   7902    FORD
13   7934  MILLER

```
select * from emp where deptno=10;
```

In [130]:
emp[ emp['deptno']==10 ]

    empno   ename        job     mgr   hiredate   sal  comm  deptno
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450   NaN      10
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000   NaN      10
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300   NaN      10

```
select empno, ename from emp where deptno=10;
```

In [138]:
emp[ emp['deptno']==10 ].loc[:,['empno','ename']]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

In [146]:
emp.loc[:,['empno','ename']][ emp['deptno']==10 ]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

In [143]:
emp[ emp['deptno']==10 ][ ['empno','ename'] ]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

In [144]:
emp[ ['empno','ename'] ][ emp['deptno']==10 ]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

## 멀티조건

and: &

or: |
```
df[ (조건) & ( (조건) | (조건) ) ]
```

```
select empno, ename from emp where deptno=10 and sal>2000;
```

In [168]:
emp[ ['empno','ename','sal'] ][ ( emp['deptno']==10 ) & ( emp['sal']>2000 ) ]

   empno ename   sal
6   7782   CCC  2450
8   7839  KING  5000

## 서브쿼리 비추비추

```
select job from emp where empno=7369;

select ename, job from emp where job=(select job from emp where empno=7369);
```
```
SMITH	CLERK
ADAMS	CLERK
JAMES	CLERK
MILLER	CLERK
```

In [186]:
emp[ 'job' ][ emp['empno']==7369 ].values[0]

'CLERK'

In [187]:
job = emp[ 'job' ][ emp['empno']==7369 ].values[0]

emp[ ['ename','job'] ][ emp['job']==job ]

     ename    job
0    SMITH  CLERK
10   ADAMS  CLERK
11   JAMES  CLERK
13  MILLER  CLERK

```
select job from emp where deptno=10;

select ename, job from emp where job in (select job from emp where deptno=10);
```
```
CLARK	MANAGER
BLAKE	MANAGER
JONES	MANAGER
KING	PRESIDENT
MILLER	CLERK
JAMES	CLERK
ADAMS	CLERK
SMITH	CLERK
```

In [211]:
emp[ 'job' ][ emp['deptno']==10 ].values.tolist()

['MANAGER', 'PRESIDENT', 'CLERK']

In [213]:
jobs_arr = emp[ 'job' ][ emp['deptno']==10 ].values
jobs_list = emp[ 'job' ][ emp['deptno']==10 ].values.tolist()

emp[ ['ename','job'] ][ emp['job'].isin(jobs_arr) ]

     ename        job
0    SMITH      CLERK
3    JONES    MANAGER
5    BLAKE    MANAGER
6      CCC    MANAGER
8     KING  PRESIDENT
10   ADAMS      CLERK
11   JAMES      CLERK
13  MILLER      CLERK

# 결측처리
```
df.dropna()
df[컬럼명].fillna(0).astype(타입)
df[컬럼명].isna()
```

```
select comm, nvl(comm,0) as comm2 from emp;
```
```
(null)	0
300	300
500	500
(null)	0
1400	1400
(null)	0
(null)	0
(null)	0
(null)	0
0	0
(null)	0
(null)	0
(null)	0
(null)	0
```

In [273]:
empcp = emp.copy()
empcp['comm2'] = empcp['comm'].fillna(0).astype('int')
empcp[['comm', 'comm2']]

      comm  comm2
0      NaN      0
1    300.0    300
2    500.0    500
3      NaN      0
4   1400.0   1400
5      NaN      0
6      NaN      0
7      NaN      0
8      NaN      0
9      0.0      0
10     NaN      0
11     NaN      0
12     NaN      0
13     NaN      0

```
select * from emp where comm is null;
```

In [284]:
emp[ emp['comm'].isna().values==True ]

    empno   ename        job     mgr   hiredate   sal  comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800   NaN      20
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975   NaN      20
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850   NaN      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450   NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000   NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000   NaN      10
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100   NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950   NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000   NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300   NaN      10

# 그룹 group by
```
df.groupby(묶을대상).first()
df.groupby(묶을대상)[컬럼명].그룹함수
df.groupby(묶을대상).agg( {컬럼명:그룹함수}, {컬럼명:[그룹함수, 그룹함수]} )
df.groupby(묶을대상)[컬럼명].agg( [그룹함수, 그룹함수, 그룹함수] )
```

## 그룹함수
```
count()
min()
max()
sum()
mean()
var()
std()
```

In [302]:
emp.groupby('deptno').first()

        empno  ename       job     mgr   hiredate   sal   comm
deptno
10       7782    CCC   MANAGER  7839.0 1981-06-09  2450    NaN
20       7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN
30       7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0

```
select deptno, count(empno) from emp group by deptno;
```
```
30	6
20	5
10	3
```

In [297]:
emp.groupby('deptno')[['empno']].count()

        empno
deptno
10          3
20          5
30          6

```
select deptno, sum(sal) from emp group by deptno;
```
```
30	9400
20	10875
10	8750
```

In [298]:
emp.groupby('deptno')[['sal']].sum()

          sal
deptno
10       8750
20      10875
30       9400

```
select deptno, max(sal), min(sal) from emp group by deptno;
```

In [319]:
emp.groupby('deptno').agg( {'sal':['max','min']} )

         sal
         max   min
deptno
10      5000  1300
20      3000   800
30      2850   950

In [318]:
emp.groupby('deptno')[['sal']].agg( ['max', 'min'] )

         sal
         max   min
deptno
10      5000  1300
20      3000   800
30      2850   950

```
select deptno, count(sal), sum(sal), max(sal), min(sal), avg(sal) from emp group by deptno;
```
```
30	6	9400	2850	950	1566.666666666666666666666666666666666667
20	5	10875	3000	800	2175
10	3	8750	5000	1300	2916.666666666666666666666666666666666667
```

In [316]:
emp.groupby('deptno')[['sal']].agg( ['sum', 'max', 'min', 'mean'] )

          sal
          sum   max   min         mean
deptno
10       8750  5000  1300  2916.666667
20      10875  3000   800  2175.000000
30       9400  2850   950  1566.666667

# 정렬 order by
```
df[컬럼명].sort_index(axis=0)
df[컬럼명].sort_values(by=기준컬럼명, ascending=False) # 고른 컬럼명 중들에서만 by가능
```

In [479]:
emp.sort_index(axis=0)

    empno   ename        job     mgr   hiredate   sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

```
select sal from emp order by sal desc;
```

In [326]:
emp['sal'].sort_values(ascending=False)

8     5000
7     3000
12    3000
3     2975
5     2850
6     2450
1     1600
9     1500
13    1300
2     1250
4     1250
10    1100
11     950
0      800
Name: sal, dtype: int64

```
select empno, ename, sal from emp where deptno=20 order by ename asc;
```
```
7876	ADAMS	1100
7902	FORD	3000
7566	JONES	2975
7788	SCOTT	3000
7369	SMITH	800
```

In [334]:
emp[ ['empno', 'ename', 'sal'] ][ emp['deptno']==20 ].sort_values(by=['ename'], ascending=True)

    empno  ename   sal
10   7876  ADAMS  1100
12   7902   FORD  3000
3    7566  JONES  2975
7    7788  SCOTT  3000
0    7369  SMITH   800

```
select empno, deptno, sal from emp order by deptno asc, sal desc;
```
```
7839	10	5000
7782	10	2450
7934	10	1300
7788	20	3000
7902	20	3000
7566	20	2975
7876	20	1100
7369	20	800
7698	30	2850
7499	30	1600
7844	30	1500
7654	30	1250
7521	30	1250
```

In [342]:
emp[ ['empno', 'deptno', 'sal'] ].sort_values(by=['deptno', 'sal'], ascending=[True, False])

    empno  deptno   sal
8    7839      10  5000
6    7782      10  2450
13   7934      10  1300
7    7788      20  3000
12   7902      20  3000
3    7566      20  2975
10   7876      20  1100
0    7369      20   800
5    7698      30  2850
1    7499      30  1600
9    7844      30  1500
2    7521      30  1250
4    7654      30  1250
11   7900      30   950

```
select empno, ename from emp order by sal desc;
```

In [408]:
# emp[ ['empno', 'ename'] ].sort_values('sal')
# 이건안됨

# 값수정
```
df[기존컬럼] = 값 # 컬럼 수정
df[신규컬럼] = 값 # 컬럼 생성
```

## 스칼라 접근
값 하나만 접근할때
```
df.at[인덱스명,컬럼명] # 값접근
df.iat[인덱스,인덱스] # 인덱스 접근
```

In [344]:
empcp = emp.copy()
empcp['comm'] = 99999
empcp

    empno   ename        job     mgr   hiredate   sal   comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800  99999      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600  99999      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250  99999      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975  99999      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  99999      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850  99999      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450  99999      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000  99999      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000  99999      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500  99999      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100  99999      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950  99999      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000  99999      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300  99999      10

In [350]:
empcp = emp.copy()
empcp.at[6,'ename'] = 'CLARK'
empcp.at[6,'ename']

'CLARK'

```
update emp set job='SALES' where deptno=10;
```

In [367]:
empcp = emp.copy()
empcp[ 'job' ][ empcp['deptno']==10 ] = 'SALES10'
empcp

C:\Users\ASIA\AppData\Local\Temp\ipykernel_16196\1118458338.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  empcp[ 'job' ][ empcp['deptno']==10 ] = 'SALES10'

    empno   ename       job     mgr   hiredate   sal    comm  deptno
0    7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE   MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC   SALES10  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT   ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING   SALES10     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER  SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS     CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES     CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD   ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER   SALES10  7782.0 1982-01-23  1300     NaN      10

이거 수정할때 이렇게 쓰지마셈

loc, ioc, at, iat 이용해서 수정 권장

그럼 조건이 붙을때 어떻게 수정??????????????????????????

## 조건

```
np.where(조건문, 참값, 거짓값) # decode와 유사하니 추천
df[컬럼명참].where(조건문, 거짓값) # 문법이 드러움 비추비추비추
```
이라는 배열을 만들고
```
df[컬럼명] = np.where(조건문, 참값, 거짓값)
df[컬럼명] = df[컬럼명참].where(조건문, 거짓값)
```
배열을 데이터프레임에 집어넣어 수정 또는 생성

In [409]:
empcp = emp.copy()
empcp['deptstr'] = np.where( emp['deptno']==10 , '십', '그외')
empcp

    empno   ename        job     mgr   hiredate   sal    comm  deptno deptstr
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20      그외
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30      그외
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30      그외
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20      그외
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30      그외
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30      그외
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10       십
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20      그외
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10       십
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30      그외
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20      그외
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30      그외
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20      그외
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10       십

```
update emp set job='SALES10' where deptno=10;
```

In [419]:
np.where( emp['deptno']==10, 'SALES10', emp['job'] )

array(['CLERK', 'SALESMAN', 'SALESMAN', 'MANAGER', 'SALESMAN', 'MANAGER',
       'SALES10', 'ANALYST', 'SALES10', 'SALESMAN', 'CLERK', 'CLERK',
       'ANALYST', 'SALES10'], dtype=object)

In [426]:
empcp = emp.copy()
#empcp.loc[ :, ['job'] ] = np.where( emp['deptno']==10, 'SALES10', emp['job'] )
empcp['job'] = np.where( emp['deptno']==10, 'SALES10', emp['job'] )
empcp.sort_values('deptno')

    empno   ename       job     mgr   hiredate   sal    comm  deptno
6    7782     CCC   SALES10  7839.0 1981-06-09  2450     NaN      10
8    7839    KING   SALES10     NaN 1981-11-17  5000     NaN      10
13   7934  MILLER   SALES10  7782.0 1982-01-23  1300     NaN      10
0    7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
3    7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
7    7788   SCOTT   ANALYST  7566.0 1987-07-13  3000     NaN      20
10   7876   ADAMS     CLERK  7788.0 1987-07-13  1100     NaN      20
12   7902    FORD   ANALYST  7566.0 1981-12-03  3000     NaN      20
1    7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
4    7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE   MANAGER  7839.0 1981-05-01  2850     NaN      30
9    7844  TURNER  SALESMAN  7698.0 1981-09-08  1500     0.0      30
11   7900   JAMES     CLERK  7698.0 1981-12-03   950     NaN      30

In [432]:
empcp = emp.copy()
empcp['job'] = empcp['job'].where( emp['deptno']!=10, 'SALES10' )
empcp.sort_values('deptno')

    empno   ename       job     mgr   hiredate   sal    comm  deptno
6    7782     CCC   SALES10  7839.0 1981-06-09  2450     NaN      10
8    7839    KING   SALES10     NaN 1981-11-17  5000     NaN      10
13   7934  MILLER   SALES10  7782.0 1982-01-23  1300     NaN      10
0    7369   SMITH     CLERK  7902.0 1980-12-17   800     NaN      20
3    7566   JONES   MANAGER  7839.0 1981-04-02  2975     NaN      20
7    7788   SCOTT   ANALYST  7566.0 1987-07-13  3000     NaN      20
10   7876   ADAMS     CLERK  7788.0 1987-07-13  1100     NaN      20
12   7902    FORD   ANALYST  7566.0 1981-12-03  3000     NaN      20
1    7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD  SALESMAN  7698.0 1981-02-22  1250   500.0      30
4    7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE   MANAGER  7839.0 1981-05-01  2850     NaN      30
9    7844  TURNER  SALESMAN  7698.0 1981-09-08  1500     0.0      30
11   7900   JAMES     CLERK  7698.0 1981-12-03   950     NaN      30

# 삭제 delete
```
drop(인덱스명, axis=0) # 로우 삭제 delete emp where ...;
drop(컬럼명, axis=1) # 컬럼 삭제
del df # 데이터프레임 삭제 drop emp;
```

In [464]:
empcp = emp.copy()
#empcp.drop(0, inplace=True)
empcp = empcp.drop([1,3,5], axis=0)
empcp = empcp.drop(['sal', 'comm'], axis=1)
empcp

    empno   ename        job     mgr   hiredate  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17      20
2    7521    WARD   SALESMAN  7698.0 1981-02-22      30
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28      30
6    7782     CCC    MANAGER  7839.0 1981-06-09      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13      20
8    7839    KING  PRESIDENT     NaN 1981-11-17      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13      20
11   7900   JAMES      CLERK  7698.0 1981-12-03      30
12   7902    FORD    ANALYST  7566.0 1981-12-03      20
13   7934  MILLER      CLERK  7782.0 1982-01-23      10

근데 이거 잘 안씀
```
emp.columns.values.tolist()
```
해서 쓰고싶은 컬럼만 골라서 데려옴

In [468]:
empcp = emp.copy()
del empcp
empcp

NameError: name 'empcp' is not defined

함수안에서 불러오고 함수 끝날때 del로 지우면 좋을듯

1. emp.csv파일을 불러와서 emp로 저장하세요

In [481]:
emp = pd.read_csv('../file/emp.csv', parse_dates=['HIREDATE'])
emp

    EMPNO   ENAME        JOB     MGR   HIREDATE   SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

In [484]:
emp.fillna(9999999)

    EMPNO   ENAME        JOB        MGR   HIREDATE   SAL       COMM  DEPTNO
0    7369   SMITH      CLERK     7902.0 1980-12-17   800  9999999.0      20
1    7499   ALLEN   SALESMAN     7698.0 1981-02-20  1600      300.0      30
2    7521    WARD   SALESMAN     7698.0 1981-02-22  1250      500.0      30
3    7566   JONES    MANAGER     7839.0 1981-04-02  2975  9999999.0      20
4    7654  MARTIN   SALESMAN     7698.0 1981-09-28  1250     1400.0      30
5    7698   BLAKE    MANAGER     7839.0 1981-05-01  2850  9999999.0      30
6    7782     CCC    MANAGER     7839.0 1981-06-09  2450  9999999.0      10
7    7788   SCOTT    ANALYST     7566.0 1987-07-13  3000  9999999.0      20
8    7839    KING  PRESIDENT  9999999.0 1981-11-17  5000  9999999.0      10
9    7844  TURNER   SALESMAN     7698.0 1981-09-08  1500        0.0      30
10   7876   ADAMS      CLERK     7788.0 1987-07-13  1100  9999999.0      20
11   7900   JAMES      CLERK     7698.0 1981-12-03   950  9999999.0      30
12   7902    FORD    ANALYST     7566.0 1981-12-03  3000  9999999.0      20
13   7934  MILLER      CLERK     7782.0 1982-01-23  1300  9999999.0      10

In [486]:
emp[ ['ENAME','JOB'] ][emp['DEPTNO']==10]

     ENAME        JOB
6      CCC    MANAGER
8     KING  PRESIDENT
13  MILLER      CLERK

In [490]:
emp.columns = emp.columns.str.lower()
emp

    empno   ename        job     mgr   hiredate   sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

In [498]:
emp.groupby('deptno')[['sal']].agg(['max', 'min', 'count'])

         sal
         max   min count
deptno
10      5000  1300     3
20      3000   800     5
30      2850   950     6

In [500]:
emp.iloc[4:11,0:4]

    empno   ename        job     mgr
4    7654  MARTIN   SALESMAN  7698.0
5    7698   BLAKE    MANAGER  7839.0
6    7782     CCC    MANAGER  7839.0
7    7788   SCOTT    ANALYST  7566.0
8    7839    KING  PRESIDENT     NaN
9    7844  TURNER   SALESMAN  7698.0
10   7876   ADAMS      CLERK  7788.0

In [501]:
emp.loc[4:10,'empno':'mgr']

    empno   ename        job     mgr
4    7654  MARTIN   SALESMAN  7698.0
5    7698   BLAKE    MANAGER  7839.0
6    7782     CCC    MANAGER  7839.0
7    7788   SCOTT    ANALYST  7566.0
8    7839    KING  PRESIDENT     NaN
9    7844  TURNER   SALESMAN  7698.0
10   7876   ADAMS      CLERK  7788.0